---
kind: type
id: T:Autodesk.Revit.DB.View
zh: 视图
source: html/fb92a4e7-f3a7-ef14-e631-342179b18de9.htm
---
# Autodesk.Revit.DB.View

**中文**: 视图

Base class for all types of views in Autodesk Revit.

## Syntax (C#)
```csharp
public class View : Element
```

## Remarks
A view can display an image produced from a Revit model.
 Views can be graphical (e.g. plans, elevations, or 3D views)
 or textual (e.g. schedules). Views keep track of Elements that can be seen in them.